#1~n까지의 합을 계산하는 함수
def cal_(a):
    total = 0
    for i in range(1,a+1):
        total += i
    return total

print(cal_(50))

#반지름을 전달하면 원의 면적을 반환하는 cir_area(r) 함수와 원의 둘레를 반환하는 cir_cirm(r) 함수를 작성하라. 이들 함수를 이용하여 반지름이 3.5cm인 원의 면적과 둘레를 소수점 아래 첫 자리까지 구하라.


#den(n) 함수를 이용하여 약수를 구하여 반환하는 프로그램을 작성
#12 → [1, 2, 3, 4, 6, 12]


#두 개의 매개변수 n, m을 전달받아 m x n개의 * 상자를 출력하는 프로그램을 함수로 

#두 개의 문자열이 서로 다른 처음 위치를 반환하는 함수를 작성. 두 개의 문자열이 같으면 -1을 반환

#문자열과 하나의 문자를 전달받아 문자열에서 문자의 위치를 모두 찾아 리스트로 반환하는 함수를 작성

#재귀 함수를 이용하여 1부터 100까지의 합을 계산하는 프로그램

